let x = 5;
alert( x++ ); // Какое будет выведено значение? (5)
[] + false - null + true; // Чему равно такое выражение? (NaN)
let y = 1;
x = y = 2;
alert(x); // Что выведет этот код? (2)
[ ] + 1 + 2; // Чему равна сумма? (12)
alert( "1"[0] ); // Что выведет этот код? (1)
2 && 1 && null && 0 && undefined; // Чему равно? (null)
'!!( a && b ) и (a && b)'; // Есть ли разница между выражениями? (ЕСТЬ)
alert( null || 2 && 3 || 4 ); // Что выведет этот код? (3)
a = [1, 2, 3]; b = [1, 2, 3];  // Правда ли что a == b: (ДА)
alert( +"Infinity" ); // Что выведет этот код? (Infinity)
"ёжик" > "яблоко"; // Верно ли сравнение: (ДА)
0 || "" || 2 || undefined || true || falsе; // Чему равно? (2)

